const messagesRu = {
    message: {
    // main
    helloMyName:   'Привет! Меня зовут',
    myName: 'Константин',
    myProfession: 'Я фронтенд разработчик',
    letsStart: 'Познакомимся',

    // header
    linkAbout: 'обо мне',
    linkResume: 'резюме',
    linkContacts: 'контакты',

    // about
    someAboutMe: 'Немного обо мне',
    aboutText1: 'Меня зовут Константин, в профессиональной деятельности я занимаюсь',
    aboutText2: 'фронтенд-разработкой и проектным менеджментом.',
    aboutText3: 'В настоящее время живу в',
    aboutText4: 'Санкт-Петербурге',
    aboutText5: ' (но если что готов к переезду в европейские страны ;) ).',
    aboutText6: 'Мне нравятся работать со всем что относится к визуалу и имеет код, поэтому решил идти в',
    aboutText7: 'фронтенд разработку',
    aboutText8: 'также владею различными инструментами веб-дизайнера. На этом не останавливаюсь и стараюсь пробовать что-то новое.',
    aboutText9: 'В свободное время увлекаюсь',
    aboutText10: 'фотографией и видеосъемкой',
    aboutText11: 'в основном воздушной, также люблю паять различные штуки, из готовых проектов несколько ',
    aboutText12: 'механических клавиатур',
    aboutText13: 'ещё  активно  слежу за компьютерными железками и игровой индустрией.',


    // footer
    footerCCCopy: 'мело можно копировать если что-то понравилось',


    // porfolio
    titleResume: 'Резюме',
    titleExp: 'Опыт',
    titleSkilzzz: 'Навыки',
    titleCourses: 'Образование, курсы',

    titleCompanie1: 'Эм Си Арт',
    titleCompanie2: 'Digimatix',
    titleCompanie3: 'МК-Медиа',
    titleCompanie4: 'Компьютерные системы и сервис',
    titleCompanie5: 'ОАО Сбербанк',
    

    titleSkill1: 'Фронтенд',
    titleSkill2: 'UI / UX, обработка',
    titleSkill3: 'Менеджмент',
    titleSkill4: 'Прочее',


    courseTitle1: 'Стратоплан',
    courseTitle2: '1С - Битрикс',
    courseTitle3: 'ТТИ ЮФУ',

    currentTimeTitle: 'Текущий момент',

    educationInfo1: 'Сертификат менеджера проектов',
    educationInfo2: 'Сертификат Контент-менеджер',
    educationInfo3: 'Сертификат Установка и настройка',
    educationInfo4: 'Сертификат Администратор базовый',
    educationInfo5: 'Магистратура, производственный менеджмент',
    educationInfo6: 'Бакалавриат, менеджмент',



    managementSkill1: 'Коммуникация с enterpise заказчиками',
    managementSkill2: 'Протоколирование',
    managementSkill3: 'Сбор и формализация требований',
    managementSkill4: 'Оценка сроков',
    managementSkill5: 'Контроль качества',
    managementSkill6: 'Работа с счетами',
    managementSkill7: 'Управление командой разработки',
    managementSkill8: 'Управление внутренним продуктом',
    managementSkill9: 'Планирование',
    managementSkill10: 'Прототипирование',

    otherSkill1: 'Управление и съемка с БПЛА (FPV, DJI)',
    otherSkill2: 'Фотография на полупрофессиональные зеркальные фотокамеры',
    otherSkill3: 'Пайка компонентов ',
    otherSkill4: 'Отличное знание ПК и орг. техники',
    otherSkill5: 'Организация эргономичного рабочего пространства',
    otherSkill6: 'Базовые понятия блокчейн систем',
    otherSkill7: 'Пользователь DeFi',
    otherSkill8: 'Английский В2',


    myPosition1: 'Фронтенд разработчик, менеджер проектов',
    myPosition2: 'Фронтенд разработчик',
    myPosition3: 'Верстальщик, контент менеджер',
    myPosition4: 'Сервисный инженер',
    myPosition5: 'Промоутер-консультант',

    myExp1: 'Ведение проектной деятельности',
    myExp2: 'Коммуникация с российскими и зарубежными клиентами',
    myExp3: 'Составление протоколов встреч',
    myExp4: 'Сбор и формализация требований к задачам',
    myExp5: 'Оценка сроков, определение исполнителей',
    myExp6: 'Контроль качества выполнения задач',
    myExp7: 'Участие в развитии внутреннего продукта',
    myExp8: 'Разработка корпоративных порталов',
    myExp9: 'Разработка внутренних модулей и приложений',
    myExp10: 'Поддержка и расширение корпоративных порталов',
    myExp11: 'Разработка приложений и сервисов с использованием Vue JS',
    myExp12: 'Редактирование графики и макетов',
    myExp13: 'Разработка сайтов',
    myExp14: 'Разработка лендингов (landing page)',
    myExp15: 'Техническая поддержка клиентов',
    myExp16: 'Верстка по макетам',
    myExp17: 'Bootstrap верстка',
    myExp18: 'PixelPerfect верстка',
    myExp19: 'Разворачивание кастомной CMS (yii) и натягивание сверстаных шаблонов',
    myExp20: 'Настройка рекламных компаний на Avito',
    myExp21: 'Подключение и мониторинг счетчиков Google Adwards и Яндекс.Метрика',
    myExp22: 'Консультация и обучение клиентов по кастомной CMS',
    myExp23: 'Ремонт орг. техники',
    myExp24: 'Ремонт стационарных компьютеров, ноутбуков',
    myExp25: 'Ремонт телефонов, смартфонов ',
    myExp26: 'Ремонт комплектующих (материнские платы, видеоадаптеры)',
    myExp27: 'Профилактика и диагностика компьютеров и орг техники',
    myExp28: 'Монтаж сетей, настройка роутеров и модемов',
    myExp29: 'Заправка картриджей',
    myExp30: 'Помощь клиентам банка с устройствами самообслуживания',
    myExp31: 'Консультирование и перенаправление к ответственным специалистам',



    // header

    indexTitle: 'Привет! Ты на главной странице моего сайта!',
    aboutTitle: 'Это страница обо мне',
    resumeTitle: 'Резюме',
    contactsTitle: 'Мои контакты',

    indexDescription: 'Главная, фронтенд разработка',
    aboutDescription: 'Обо мне, фронтенд разработчик',
    resumeDescription: 'Резюме, фронтенд разработчик',
    contactsDescription: 'Контакты, фронтенд разработка',

    
    indexContent: 'Сайт фронтенд разработчика',
    aboutContent: 'Информация о фронтенд разработчике',
    resumeContent: 'Резюме фронтенд разработчика',
    contactsContent: 'Контакты фронтенд разработчика',

    }

}

export default messagesRu