const messagesRu = {
    message: {
    // main
    helloMyName:   'Привет! Меня зовут',
    myName: 'Константин',
    myProfession: 'Я фронтенд разработчик',
    letsStart: 'Познакомимся',

    // header
    linkAbout: 'обо мне',
    linkResume: 'резюме',
    linkContacts: 'контакты',

    // about
    someAboutMe: 'Немного обо мне',
    aboutText1: 'Меня зовут Константин, в профессиональной деятельности я занимаюсь',
    aboutText2: 'фронтенд-разработкой и проектным менеджментом.',
    aboutText3: 'В настоящее время живу в',
    aboutText4: 'Санкт-Петербурге',
    aboutText5: ' (но если что готов к переезду в европейские страны ;) ).',
    aboutText6: 'Мне нравятся работать со всем что относится к визуалу и имеет код, поэтому решил идти в',
    aboutText7: 'фронтенд разработку',
    aboutText8: 'также владею различными инструментами веб-дизайнера. На этом не останавливаюсь и стараюсь пробовать что-то новое.',
    aboutText9: 'В свободное время увлекаюсь',
    aboutText10: 'фотографией и видеосъемкой',
    aboutText11: 'в основном воздушной, также люблю паять различные штуки, из готовых проектов несколько ',
    aboutText12: 'механических клавиатур',
    aboutText13: 'ещё  активно  слежу за компьютерными железками и игровой индустрией.',


    // footer
    footerCCCopy: 'мело можно копировать если что-то понравилось',


    // porfolio
    titleResume: 'Резюме',
    titleExp: 'Опыт',
    titleSkilzzz: 'Навыки',
    titleCourses: 'Образование, курсы',

    titleFreelance: 'Фриланс',
    titleCompanie1: 'Эм Си Арт',
    titleCompanie2: 'Digimatix',
    titleCompanie3: 'МК-Медиа',
    titleCompanie4: 'Компьютерные системы и сервис',
    titleCompanie5: 'ОАО Сбербанк',
    

    titleSkill1: 'Разработка',
    titleSkill2: 'UI / UX, обработка',
    titleSkill3: 'Менеджмент',
    titleSkill4: 'Прочее',


    courseTitle1: 'Стратоплан',
    courseTitle2: '1С - Битрикс',
    courseTitle3: 'ТТИ ЮФУ',

    currentTimeTitle: 'Текущий момент',

    educationInfo1: 'Сертификат менеджера проектов',
    educationInfo2: 'Сертификат Контент-менеджер',
    educationInfo3: 'Сертификат Установка и настройка',
    educationInfo4: 'Сертификат Администратор базовый',
    educationInfo5: 'Магистратура, производственный менеджмент',
    educationInfo6: 'Бакалавриат, менеджмент',



    myPosition1: 'Фронтенд разработчик, менеджер проектов',
    myPosition2: 'Фронтенд разработчик',
    myPosition3: 'Верстальщик, контент менеджер',
    myPosition4: 'Сервисный инженер',
    myPosition5: 'Промоутер-консультант',

    skillsDev: [
        {skill: 'HTML5'},
        {skill: 'CSS (Vanila CSS, LESS, SCSS, Bootstrap)'},
        {skill: 'Javascript (jQuery, Vue JS, Nuxt JS)'},
        {skill: 'Dart (Flutter)'},
        {skill: 'SVG'},
        {skill: 'Git'},
    ],

    uxui: [
        {skill: 'Figma'},
        {skill: 'Photoshop'},
        {skill: 'Lightroom'},
        {skill: 'CorelDRAW'},
    ],


    management: [
        {skill: 'Коммуникация с enterpise заказчиками'},
        {skill: 'Протоколирование'},
        {skill: 'Сбор и формализация требований'},
        {skill: 'Оценка сроков'},
        {skill: 'Контроль качества выполнения задач'},
        {skill: 'Работа с счетами'},
        {skill: 'Управление командой разработки'},
        {skill: 'Управление внутренним продуктом'},
        {skill: 'Планирование'},
        {skill: 'Прототипирование'},
    ],

    otherSkillz: [
        {skill: 'Управление и съемка с БПЛА (FPV, DJI)'},
        {skill: 'Фотография на полупрофессиональные зеркальные фотокамеры'},
        {skill: 'Пайка компонентов '},
        {skill: 'Отличное знание ПК и орг. техники'},
        {skill: 'Организация эргономичного рабочего пространства'},
        {skill: 'Базовые понятия блокчейн систем'},
        {skill: 'Пользователь DeFi'},
        {skill: 'Английский В1'},
    ],


    managmentExp: [
        {skill: 'Управление командой.'},
        {skill: 'Управление ожиданиями: сбор обратной связи, ведение бэклога.'},
        {skill: 'Отслеживание прогресса и ведение отчетности.'},
        {skill: 'Разработка проектной документации (база знаний по проекту).'},
        {skill: 'Создание прототипов дизайна.'},
        {skill: 'Уточнение требований, интерфейсов и архитектуры.'},
        {skill: 'Доставка вовремя и в рамках бюджета.'},
        {skill: 'Анализ рисков, устранение проблем и отчетность.'},
        {skill: 'Коммуникация и управление иностранными клиентами (Германия).'},
    ],

    subHeadingsExp: [
        {heading: 'Менеджмент'},
        {heading: 'Разработка'},
    ],
    
    expDevMCArt: [
        {skill: 'Разработка корпоративных порталов интранет/экстранет (B2B, B2C) с поддержкой IE10.'},
        {skill: 'Разработка внутренних модулей и приложений для маркетплейса.'},
        {skill: 'Разработка приложений с использованием Bitrix REST API.'},
        {skill: 'Разработка приложений и сервисов Vue JS (v2).'},
        {skill: 'Разработка внутреннего мобильного продукта с использованием Flutter framework.'},
        {skill: 'Создание и поддержание базы знаний'},
        {skill: 'Помощь back-end  разработчикам с вопросами и проблемами по front-end.'},
        {skill: 'UX/UI консультирование.'},
        {skill: 'Редактирование и создание дизайна (Adobe PS, Figma).'},
        {skill: 'Наставничество и обучение.'}
    ],

    expDevDigimatix: [
        {skill: 'Создание модульных адаптивных шаблонов с использованием современных методов CSS (включая Bootstrap) и библиотек JavaScript (GULP).'},
        {skill: 'Создание шаблонов для высоконагруженных торговых площадок B2C.'},
        {skill: 'Создание лендинговых страниц'},
        {skill: 'Разработка и внедрение сайтов с концепцией PixelPerfect.'},
        {skill: 'Коммуникация и техподдержка клиентов.'},
        {skill: 'UX/UI консультирование.'},
        {skill: 'Редактирование графики для разработки (Adobe PS).'},
    ],

    expDevMKMedia: [
        {skill: 'Разработка кросс-браузерных решений с применением  лучших практик HTML5, CSS и JavaScript для соответствия спецификациям дизайна с соблюдением стандартов кода.'},
        {skill: 'Внедрение подхода, ориентированного на мобильные устройства, на существующих веб-сайтах.'},
        {skill: 'Тесное сотрудничество с дизайнерами и back-end разработчиками.'},
        {skill: 'Работа напрямую с клиентом для решения технических задач.'},
        {skill: 'Создание лендинговых страниц'},
        {skill: 'Редактирование графики для разработки (Adobe PS).'},
    ],

    expEngCSaS: [
        {skill: 'Ремонт офисной техники.'},
        {skill: 'Ремонт PC, ноутбуков.'},
        {skill: 'Ремонт телефонов, смартфонов.'},
        {skill: 'Ремонт компонентов (материнские платы, видеоадаптеры).'},
        {skill: 'Диагостика и обслуживание офисной техники.'},
        {skill: 'Прокладка сетей, настройка сетевого оборудования(модемы, роутеры), монтаж видеосистем.'},
        {skill: 'Заправка картриджей.'},
    ],

    expPromSber: [
        {skill: 'Помощь клиентам с терминалами самообслуживания и банкоматами'},
        {skill: 'Консультирование и помощь по сервисам'},
    ],

    expFreelance: [
        {skill: 'Встреча с клиентами для обзора веб-сайта, сбор спецификаций запросов клиентов для новых или существующих веб-сайтов.'},
        {skill: 'Разработка кросс-браузерных веб-сайтов (магазины, образовательные сайты, лендинг страницы, маркетинговые страницы).'},
        {skill: 'UI/UX конусльтирование.'},
        {skill: 'Участвовал в разработке более 100+ различных проектов для клиентов из самых разных отраслей.'},
    ],


    


    // header

    indexTitle: 'Фронтенд разработчик • Константин Фатеев',
    aboutTitle: 'Это страница обо мне',
    resumeTitle: 'Резюме',
    contactsTitle: 'Мои контакты',

    indexDescription: 'Главная, фронтенд разработка',
    aboutDescription: 'Обо мне, фронтенд разработчик',
    resumeDescription: 'Резюме, фронтенд разработчик',
    contactsDescription: 'Контакты, фронтенд разработка',

    
    indexContent: 'Сайт фронтенд разработчика',
    aboutContent: 'Информация о фронтенд разработчике',
    resumeContent: 'Резюме фронтенд разработчика',
    contactsContent: 'Контакты фронтенд разработчика',

    }

}

export default messagesRu